# 7장 데이터 합치기/변형

책 p. 250

In [1]:
from pandas import Series, DataFrame
import pandas as pd

In [33]:
df1 = DataFrame({
        'key': list('bbacaab'),
        'data1': range(7)
    })

In [36]:
df1 = df1[['key','data1']]
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [19]:
df2 = DataFrame({
        'key': list('abd'),
        'data2': range(3)
    })

In [20]:
df2

   data2 key
0      0   a
1      1   b
2      2   d

In [23]:
df2 = df2[['key', 'data2']]

In [24]:
pd.merge(df1, df2)[['key', 'data1', 'data2']]

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [26]:
pd.merge(df1, df2, on='key')[['key', 'data1', 'data2']]

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [37]:
df1.columns = ['key1', 'data1']

In [38]:
df1

  key1  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

In [39]:
df2.columns = ['key2', 'data2']

In [40]:
df2

  key2  data2
0    a      0
1    b      1
2    d      2

In [45]:
df = pd.merge(df1, df2, left_on='key1', right_on='key2')
df.drop('key2', axis=1)

  key1  data1  data2
0    b      0      1
1    b      1      1
2    b      6      1
3    a      2      0
4    a      4      0
5    a      5      0

#### 연습

(데자뷰?!) data/pydata-book/movielens 폴더에는 영화 평점과 관련 된 세 개의 파일이 있다.

이 파일을 데이터프레임으로 읽어들여 ratings.dat를 기준으로 모두 합친다.

1. ratings 와 users 합치기
1. ratings 와 movies 합치기
1. ratings, movies, users 합치기

In [54]:
ratings = pd.read_csv('data/pydata-book/movielens/ratings.dat', sep='::', engine='python', 
                    header=None, names=['user_id', 'movie_id', 'rating', 'timestamp'])
ratings[:5]

   user_id  movie_id  rating  timestamp
0        1      1193       5  978300760
1        1       661       3  978302109
2        1       914       3  978301968
3        1      3408       4  978300275
4        1      2355       5  978824291

In [52]:
users = pd.read_csv('data/pydata-book/movielens/users.dat', sep='::', engine='python', 
                    header=None, names=['user_id', 'gender', 'age', 'occupation', 'zipcode'])
users[:4]

   user_id gender  age  occupation zipcode
0        1      F    1          10   48067
1        2      M   56          16   70072
2        3      M   25          15   55117
3        4      M   45           7   02460

In [56]:
movies = pd.read_csv('data/pydata-book/movielens/movies.dat', sep='::', engine='python', 
                    header=None, names=['movie_id', 'movie_name', 'genre'])
movies[:5]

   movie_id                          movie_name                         genre
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy

In [58]:
pd.merge(ratings, users)[:10]

   user_id  movie_id  rating  timestamp gender  age  occupation zipcode
0        1      1193       5  978300760      F    1          10   48067
1        1       661       3  978302109      F    1          10   48067
2        1       914       3  978301968      F    1          10   48067
3        1      3408       4  978300275      F    1          10   48067
4        1      2355       5  978824291      F    1          10   48067
5        1      1197       3  978302268      F    1          10   48067
6        1      1287       5  978302039      F    1          10   48067
7        1      2804       5  978300719      F    1          10   48067
8        1       594       4  978302268      F    1          10   48067
9        1       919       4  978301368      F    1          10   48067

In [60]:
pd.merge(ratings, movies)[:10]

,user_id,movie_id,rating,timestamp,movie_name,genre
0,1,1193,5,978300760,One Flew Over the Cuckoo's Nest (1975),Drama
1,2,1193,5,978298413,One Flew Over the Cuckoo's Nest (1975),Drama
2,12,1193,4,978220179,One Flew Over the Cuckoo's Nest (1975),Drama
3,15,1193,4,978199279,One Flew Over the Cuckoo's Nest (1975),Drama
4,17,1193,5,978158471,One Flew Over the Cuckoo's Nest (1975),Drama
5,18,1193,4,978156168,One Flew Over the Cuckoo's Nest (1975),Drama
6,19,1193,5,982730936,One Flew Over the Cuckoo's Nest (1975),Drama
7,24,1193,5,978136709,One Flew Over the Cuckoo's Nest (1975),Drama
8,28,1193,3,978125194,One Flew Over the Cuckoo's Nest (1975),Drama
9,33,1193,5,978557765,One Flew Over the Cuckoo's Nest (1975),Drama

In [62]:
pd.merge(pd.merge(ratings, movies), users)[:10]

,user_id,movie_id,rating,timestamp,movie_name,genre,gender,age,occupation,zipcode
0,1,1193,5,978300760,One Flew Over the Cuckoo's Nest (1975),Drama,F,1,10,48067
1,1,661,3,978302109,James and the Giant Peach (1996),Animation|Children's|Musical,F,1,10,48067
2,1,914,3,978301968,My Fair Lady (1964),Musical|Romance,F,1,10,48067
3,1,3408,4,978300275,Erin Brockovich (2000),Drama,F,1,10,48067
4,1,2355,5,978824291,"Bug's Life, A (1998)",Animation|Children's|Comedy,F,1,10,48067
5,1,1197,3,978302268,"Princess Bride, The (1987)",Action|Adventure|Comedy|Romance,F,1,10,48067
6,1,1287,5,978302039,Ben-Hur (1959),Action|Adventure|Drama,F,1,10,48067
7,1,2804,5,978300719,"Christmas Story, A (1983)",Comedy|Drama,F,1,10,48067
8,1,594,4,978302268,Snow White and the Seven Dwarfs (1937),Animation|Children's|Musical,F,1,10,48067
9,1,919,4,978301368,"Wizard of Oz, The (1939)",Adventure|Children's|Drama|Musical,F,1,10,48067

In [74]:
df2 = df2.set_index('key2')
df2

      data2
key2
a         0
b         1
d         2

pd.merge(df1, df2, left_on='key1', right_on='key2')

색인은 열이 아니다.

In [73]:
df2 = df2.reset_index()

In [69]:
df2

  key2  data2
0    a      0
1    b      1
2    d      2

In [77]:
pd.merge(df1, df2, left_on='key1', right_index=True)

  key1  data1  data2
0    b      0      1
1    b      1      1
6    b      6      1
2    a      2      0
4    a      4      0
5    a      5      0

In [70]:
df2 = df2.set_index('key2')

In [71]:
df1.join(df2)

  key1  data1  data2
0    b      0    NaN
1    b      1    NaN
2    a      2    NaN
3    c      3    NaN
4    a      4    NaN
5    a      5    NaN
6    b      6    NaN

#### 연습

data/food_order.xlsx 와 data/weather.xlsx 를 각각 데이터프레임으로 구성하고, 두 개의 데이터프레임을 하나로 합쳐 변수 '식당날씨'에 저장한다.

1. data 열을 기준으로 합친다.
1. 식당과 날씨 자료의 date 열을 각각 색인으로 설정하고, 색인을 기준으로 합친다.

In [80]:
식당 = pd.read_excel('data/food_order.xlsx')
식당[:3]

,date,dine_type,corner,menu,is_sold_out,use_count,pred_count,additional,good,ok,bad,diff_use_pred,year,month,day,wday
0,2013-08-06,dinner,grill & fry,훈제연어벤또(200개),F,213,0,0,0,0,0,-213,2013,8,6,1
1,2013-08-06,dinner,rice & soup 1,뚝배기 우거지 갈비탕,F,261,0,0,0,0,0,-261,2013,8,6,1
2,2013-08-06,lunch,noodle bar,판모밀정식,F,267,0,0,0,0,0,-267,2013,8,6,1

In [79]:
날씨 = pd.read_excel('data/weather.xlsx')
날씨[:3]

,location,date,weekDay,avgTemp,highestTemp,lowestTemp,precipitation,snow,windSpeed,humidity,cloud,dayTime,weather
0,seoul,2013-08-01,thur,28.0,32.1,24.5,-,-,1.8,66,7.1,6.0,구름많음
1,seoul,2013-08-02,fri,27.4,29.3,25.2,7.5,-,2.1,79,9.1,0.9,흐림/안개/비
2,seoul,2013-08-03,sat,28.9,32.6,26.7,0.1,-,3.6,72,8.1,8.9,흐림/소나기

In [81]:
식당 = 식당.set_index('date')
식당[:3]

,dine_type,corner,menu,is_sold_out,use_count,pred_count,additional,good,ok,bad,diff_use_pred,year,month,day,wday
date,,,,,,,,,,,,,,,
2013-08-06,dinner,grill & fry,훈제연어벤또(200개),F,213,0,0,0,0,0,-213,2013,8,6,1
2013-08-06,dinner,rice & soup 1,뚝배기 우거지 갈비탕,F,261,0,0,0,0,0,-261,2013,8,6,1
2013-08-06,lunch,noodle bar,판모밀정식,F,267,0,0,0,0,0,-267,2013,8,6,1

In [82]:
날씨 = 날씨.set_index('date')
날씨[:3]

,location,weekDay,avgTemp,highestTemp,lowestTemp,precipitation,snow,windSpeed,humidity,cloud,dayTime,weather
date,,,,,,,,,,,,
2013-08-01,seoul,thur,28.0,32.1,24.5,-,-,1.8,66,7.1,6.0,구름많음
2013-08-02,seoul,fri,27.4,29.3,25.2,7.5,-,2.1,79,9.1,0.9,흐림/안개/비
2013-08-03,seoul,sat,28.9,32.6,26.7,0.1,-,3.6,72,8.1,8.9,흐림/소나기

In [87]:
식당날씨 = 식당.join(날씨)

In [88]:
식당날씨[['menu', 'weather']][:3]

                    menu           weather
date
2013-08-06  훈제연어벤또(200개)    구름많음/안개/천둥번개/비
2013-08-06  훈제연어벤또(200개)  구름많음/소나기/안개/천둥번개
2013-08-06   뚝배기 우거지 갈비탕    구름많음/안개/천둥번개/비

In [89]:
import baseball

In [90]:
파일목록 = []
for 연도 in range(2013, 2016):
    경로 = 'data/NC Dinos {}.xlsx'.format(연도)
    파일목록.append(경로)

In [91]:
NC시즌 = baseball.from_files(파일목록)

색인방향(axis=0) ~ "세로"로 이어붙이기

In [93]:
pd.concat(NC시즌)[:10]

      안타  홈런   타석
선수명
모창민  109  12  436
이호준  123  20  508
김종호  129   0  546
나성범   98  14  458
조영훈  107   6  426
이현곤   38   0  161
이상호   31   0  138
강진성    1   0    3
조평호   21   2   86
박민우   11   0   48

열 방향(axis=1, "가로로 이어붙이기

색인 기준으로 붙음.

In [94]:
홈런 = [NC시즌[0].홈런, NC시즌[1].홈런, NC시즌[2].홈런]

In [99]:
홈런 = pd.concat(홈런, axis=1)
홈런[:3]

      홈런   홈런   홈런
강구성  0.0  NaN  0.0
강민국  NaN  0.0  0.0
강진성  0.0  NaN  NaN

#### 연습

NC 타자들의 지난 3년간 누적 타율 계산

In [96]:
안타 = [NC시즌[0].안타, NC시즌[1].안타, NC시즌[2].안타]

In [97]:
안타 = pd.concat(안타, axis=1)

In [98]:
안타[:3]

      안타   안타   안타
강구성  0.0  NaN  1.0
강민국  NaN  0.0  0.0
강진성  1.0  NaN  NaN

In [100]:
타석 = [NC시즌[0].타석, NC시즌[1].타석, NC시즌[2].타석]

In [101]:
타석 = pd.concat(타석, axis=1)
타석[:3]

      타석   타석   타석
강구성  2.0  NaN  5.0
강민국  NaN  3.0  2.0
강진성  3.0  NaN  NaN

In [103]:
홈런합 = 홈런.sum(axis=1)

In [104]:
안타합 = 안타.sum(axis=1)

In [105]:
타석합 = 타석.sum(axis=1)

In [108]:
타율 = (홈런합 + 안타합) / 타석합

In [109]:
타율[:3]

강구성    0.142857
강민국    0.000000
강진성    0.333333
dtype: float64

# 계층 색인

In [110]:
for 연도, 프레임 in zip(range(2013, 2016), NC시즌):
    프레임['시즌'] = 연도

In [114]:
NC13 = NC시즌[0].reset_index()

In [116]:
NC13.set_index(['시즌', '선수명'])[:10]

           안타  홈런   타석
시즌   선수명
2013 모창민  109  12  436
     이호준  123  20  508
     김종호  129   0  546
     나성범   98  14  458
     조영훈  107   6  426
     이현곤   38   0  161
     이상호   31   0  138
     강진성    1   0    3
     조평호   21   2   86
     박민우   11   0   48

In [118]:
NC시즌 = pd.concat(NC시즌)

In [121]:
NC시즌 = NC시즌.set_index('시즌', append=True)

계층 색인의 위치 설정

In [123]:
NC시즌 = NC시즌.swaplevel('선수명', '시즌')

In [126]:
NC시즌.ix[2013]

      안타  홈런   타석
선수명
모창민  109  12  436
이호준  123  20  508
김종호  129   0  546
나성범   98  14  458
조영훈  107   6  426
이현곤   38   0  161
이상호   31   0  138
강진성    1   0    3
조평호   21   2   86
박민우   11   0   48
박정준   41   4  195
이승호    0   0    1
마낙길    9   0   31
김성욱    1   0    4
강구성    0   0    2
지석훈   68   3  356
김종찬    1   0    7
차화준   24   1  121
김동건    2   1   17
이창섭    0   0    5

나성범 선수의 전체 시즌 기록 선택

In [132]:
NC시즌.swaplevel('시즌', '선수명').ix['나성범']

       안타  홈런   타석
시즌
2013   98  14  458
2014  157  30  536
2015  184  28  622

In [133]:
나테 = NC시즌.swaplevel(0,1).ix[['나성범', '테임즈']]

In [134]:
나테

           안타  홈런   타석
선수명 시즌
나성범 2013   98  14  458
    2014  157  30  536
    2015  184  28  622
테임즈 2014  152  37  514
    2015  180  47  595

In [139]:
나테.unstack()

       안타                  홈런                 타석
시즌   2013   2014   2015  2013  2014  2015   2013   2014   2015
선수명
나성범  98.0  157.0  184.0  14.0  30.0  28.0  458.0  536.0  622.0
테임즈   NaN  152.0  180.0   NaN  37.0  47.0    NaN  514.0  595.0

In [144]:
나테.unstack(0)

         안타           홈런           타석
선수명     나성범    테임즈   나성범   테임즈    나성범    테임즈
시즌
2013   98.0    NaN  14.0   NaN  458.0    NaN
2014  157.0  152.0  30.0  37.0  536.0  514.0
2015  184.0  180.0  28.0  47.0  622.0  595.0

In [145]:
나테.unstack('선수명')

         안타           홈런           타석
선수명     나성범    테임즈   나성범   테임즈    나성범    테임즈
시즌
2013   98.0    NaN  14.0   NaN  458.0    NaN
2014  157.0  152.0  30.0  37.0  536.0  514.0
2015  184.0  180.0  28.0  47.0  622.0  595.0

In [143]:
나테.stack()

선수명  시즌
나성범  2013  안타     98
           홈런     14
           타석    458
     2014  안타    157
           홈런     30
           타석    536
     2015  안타    184
           홈런     28
           타석    622
테임즈  2014  안타    152
           홈런     37
           타석    514
     2015  안타    180
           홈런     47
           타석    595
dtype: int64

In [174]:
NC시즌.swaplevel(0,1).sort_index().sum(level=0)

       안타  홈런    타석
선수명
강구성     1   0     7
강민국     0   0     5
강진성     1   0     3
권희동    63   7   252
김동건     2   1    17
김성욱     5   1    30
김종찬     1   0     7
김종호   254   4  1032
김준완    12   0    59
김태군   107   6   474
김태우     1   0     5
김태진     0   0     3
나성범   439  72  1616
노진혁     3   1    16
마낙길     9   0    33
모창민   281  34  1143
박명환*    0   0     1
박민우   293   4  1156
박정준    49   4   219
손시헌   198  18   869
용덕한    12   0    49
이상호    31   0   138
이승호     0   0     1
이종욱   244  11   999
이창섭     0   0    13
이현곤    38   0   161
이호준   370  67  1526
조영훈   171  20   696
조평호    29   3   110
지석훈   237  20  1060
차화준    24   1   121
최재원    21   2   104
테임즈   332  84  1109
허준      5   0    36

#### 연습

1. corner, dine_type을 색인으로 설정
1. 아침 시간대 주문 기록만 선택

In [182]:
식당2 = 식당.reset_index().set_index(['corner', 'dine_type']).sort_index()

In [184]:
아침주문 = 식당2.swaplevel(0,1).ix['breakfast']

In [186]:
아침주문 = 아침주문.set_index('date', append=True)

In [187]:
아침주문[['menu', 'use_count']][:3]

                            menu  use_count
corner        date
rice & soup 1 2013-08-06   설렁탕정식          1
              2013-08-12  뚝배기순대국         26
              2013-08-13  사골우거지탕         26

다른방식

In [189]:
아침주문2 = 식당[식당.dine_type == 'breakfast']
아침주문2[:3]

,dine_type,corner,menu,is_sold_out,use_count,pred_count,additional,good,ok,bad,diff_use_pred,year,month,day,wday
date,,,,,,,,,,,,,,,
2013-08-06,breakfast,rice & soup 1,설렁탕정식,F,1,0,0,0,0,0,-1,2013,8,6,1
2013-08-12,breakfast,rice & soup 1,뚝배기순대국,F,26,0,0,0,0,0,-26,2013,8,12,0
2013-08-13,breakfast,rice & soup 1,사골우거지탕,F,26,0,0,0,0,0,-26,2013,8,13,1

In [192]:
아침주문2.set_index('corner', append=True).swaplevel(0,1)[:3]

                          dine_type    menu is_sold_out  use_count  \
corner        date
rice & soup 1 2013-08-06  breakfast   설렁탕정식           F          1
              2013-08-12  breakfast  뚝배기순대국           F         26
              2013-08-13  breakfast  사골우거지탕           F         26

                          pred_count  additional  good  ok  bad  \
corner        date
rice & soup 1 2013-08-06           0           0     0   0    0
              2013-08-12           0           0     0   0    0
              2013-08-13           0           0     0   0    0

                          diff_use_pred  year  month  day  wday
corner        date
rice & soup 1 2013-08-06             -1  2013      8    6     1
              2013-08-12            -26  2013      8   12     0
              2013-08-13            -26  2013      8   13     1

# 데이터 변형

In [200]:
NC시즌 = NC시즌.reset_index()

In [202]:
테나 = NC시즌.set_index('선수명').ix[['나성범','테임즈']]
테나

       시즌   안타  홈런   타석
선수명
나성범  2013   98  14  458
나성범  2014  157  30  536
나성범  2015  184  28  622
테임즈  2014  152  37  514
테임즈  2015  180  47  595

In [205]:
테나테나 = pd.concat([테나] * 2)
테나테나

       시즌   안타  홈런   타석
선수명
나성범  2013   98  14  458
나성범  2014  157  30  536
나성범  2015  184  28  622
테임즈  2014  152  37  514
테임즈  2015  180  47  595
나성범  2013   98  14  458
나성범  2014  157  30  536
나성범  2015  184  28  622
테임즈  2014  152  37  514
테임즈  2015  180  47  595

In [206]:
테나테나.duplicated()

선수명
나성범    False
나성범    False
나성범    False
테임즈    False
테임즈    False
나성범     True
나성범     True
나성범     True
테임즈     True
테임즈     True
dtype: bool

In [211]:
테나테나.drop_duplicates()

       시즌   안타  홈런   타석
선수명
나성범  2013   98  14  458
나성범  2014  157  30  536
나성범  2015  184  28  622
테임즈  2014  152  37  514
테임즈  2015  180  47  595

In [213]:
테나테나.reset_index().drop_duplicates(['선수명'])

   선수명    시즌   안타  홈런   타석
0  나성범  2013   98  14  458
3  테임즈  2014  152  37  514

# 함수나 매핑을 이용해서 데이터 변형

In [217]:
식당.corner.value_counts()

rice & soup 1    1422
take out         1381
after school      929
grill & fry       925
noodle bar        923
burger&pizza      913
rice & soup 2     332
Name: corner, dtype: int64

In [220]:
분류사전 = {'rice & soup 1': '한식', 'rice & soup 2' : '한식'}

In [223]:
식당.corner.map(분류사전).value_counts()

한식    1754
Name: corner, dtype: int64

In [224]:
식당.corner.map(분류사전).fillna('기타').value_counts()

기타    5071
한식    1754
Name: corner, dtype: int64

In [229]:
날짜 = 식당.reset_index()['date']

In [231]:
날짜[:3]

0   2013-08-06
1   2013-08-06
2   2013-08-06
Name: date, dtype: datetime64[ns]

In [232]:
def 연도추출(날짜):
    return 날짜.year

날짜.map(연도추출)[:3]

0    2013
1    2013
2    2013
Name: date, dtype: int64

In [233]:
날짜.map(lambda 날짜: 날짜.year)[:3]

0    2013
1    2013
2    2013
Name: date, dtype: int64

In [237]:
식당.corner.replace(['rice & soup 1', 'rice & soup 2'], '한식').value_counts()

한식              1754
take out        1381
after school     929
grill & fry      925
noodle bar       923
burger&pizza     913
Name: corner, dtype: int64

In [238]:
식당.corner.replace(['rice & soup 1', 'rice & soup 2'], ['한식1', '한식2']).value_counts()

한식1             1422
take out        1381
after school     929
grill & fry      925
noodle bar       923
burger&pizza     913
한식2              332
Name: corner, dtype: int64

In [240]:
식당.corner.replace({
        'rice & soup 1' : '밥1',
        'burger&pizza': '버거',
        'rice & soup 2' : '밥2'
    }).value_counts()

밥1              1422
take out        1381
after school     929
grill & fry      925
noodle bar       923
버거               913
밥2               332
Name: corner, dtype: int64

In [247]:
작은식당 = 식당[['dine_type', 'corner', 'menu', 'use_count']]
작은식당[:3]

           dine_type         corner          menu  use_count
date
2013-08-06    dinner    grill & fry  훈제연어벤또(200개)        213
2013-08-06    dinner  rice & soup 1   뚝배기 우거지 갈비탕        261
2013-08-06     lunch     noodle bar         판모밀정식        267

In [250]:
작은식당.rename(columns={
        'dine_type': '시간대',
        'use_count': '주문수량'
    })[:3]

               시간대         corner          menu  주문수량
date
2013-08-06  dinner    grill & fry  훈제연어벤또(200개)   213
2013-08-06  dinner  rice & soup 1   뚝배기 우거지 갈비탕   261
2013-08-06   lunch     noodle bar         판모밀정식   267

In [249]:
작은식당.rename(columns=lambda 제목: '**{}**'.format(제목))[:3]

           **dine_type**     **corner**      **menu**  **use_count**
date
2013-08-06        dinner    grill & fry  훈제연어벤또(200개)            213
2013-08-06        dinner  rice & soup 1   뚝배기 우거지 갈비탕            261
2013-08-06         lunch     noodle bar         판모밀정식            267

In [252]:
프로그래머 = pd.read_csv('data/geeks.csv', encoding='utf8')
프로그래머

       이름                  직업     국적            트위터         생년월일
0     이성주   컴퓨터 프로그래머/데이터 과학자   대한민국   @LeeSeongjoo   1982-12-27
1  Rossum           컴퓨터 프로그래머   네덜란드    @gvanrossum   1956-01-31
2  Turing              컴퓨터과학자     영국            NaN   1912-06-23

In [253]:
프로그래머['이름']

0       이성주
1    Rossum
2    Turing
Name: 이름, dtype: object

In [256]:
프로그래머[' 직업']

0     컴퓨터 프로그래머/데이터 과학자
1             컴퓨터 프로그래머
2                컴퓨터과학자
Name:  직업, dtype: object

In [259]:
프로그래머=프로그래머.rename(columns=str.strip)

In [260]:
프로그래머['직업']

0     컴퓨터 프로그래머/데이터 과학자
1             컴퓨터 프로그래머
2                컴퓨터과학자
Name: 직업, dtype: object

In [263]:
식당.rename(index=lambda 날짜:날짜.year)[:3]

,dine_type,corner,menu,is_sold_out,use_count,pred_count,additional,good,ok,bad,diff_use_pred,year,month,day,wday
date,,,,,,,,,,,,,,,
2013,dinner,grill & fry,훈제연어벤또(200개),F,213,0,0,0,0,0,-213,2013,8,6,1
2013,dinner,rice & soup 1,뚝배기 우거지 갈비탕,F,261,0,0,0,0,0,-261,2013,8,6,1
2013,lunch,noodle bar,판모밀정식,F,267,0,0,0,0,0,-267,2013,8,6,1

In [264]:
DataFrame.rename?

# 구간 나누기

In [269]:
연령 = pd.read_excel('data/ages.xlsx', squeeze=True)
연령[:3]

0    30
1    15
2    15
Name: 연령, dtype: int64

In [270]:
len(연령)

5000

In [271]:
구간= [0, 10, 20, 30, 40, 50, 150]
연령대 = pd.cut(연령, 구간)

In [272]:
연령대[:3]

0    (20, 30]
1    (10, 20]
2    (10, 20]
Name: 연령, dtype: category
Categories (6, object): [(0, 10] < (10, 20] < (20, 30] < (30, 40] < (40, 50] < (50, 150]]

In [275]:
연령대.value_counts()

(10, 20]     3080
(20, 30]      810
(30, 40]      606
(40, 50]      310
(50, 150]     194
(0, 10]         0
Name: 연령, dtype: int64

In [276]:
pd.cut(연령, 구간, right=False).value_counts()

[10, 20)     2998
[20, 30)      822
[30, 40)      622
[40, 50)      347
[50, 150)     211
[0, 10)         0
Name: 연령, dtype: int64

In [277]:
pd.cut(연령, 구간, labels=['십대', '이십대', '삼십대', '사십대', '오십대', '그이상']).value_counts()

이십대    3080
삼십대     810
사십대     606
오십대     310
그이상     194
십대        0
Name: 연령, dtype: int64

구간의 개수 설정

In [279]:
pd.cut(연령, 4).value_counts()

(14.945, 28.75]    3749
(28.75, 42.5]       833
(42.5, 56.25]       326
(56.25, 70]          92
Name: 연령, dtype: int64

In [281]:
pd.qcut(연령.drop_duplicates(), 4)

0       (28.75, 42.5]
1         [15, 28.75]
4       (28.75, 42.5]
6         [15, 28.75]
8         [15, 28.75]
9         [15, 28.75]
10        [15, 28.75]
12        [15, 28.75]
16        [15, 28.75]
17        (56.25, 70]
21      (28.75, 42.5]
24      (28.75, 42.5]
28      (28.75, 42.5]
29        [15, 28.75]
30        [15, 28.75]
33      (28.75, 42.5]
39      (42.5, 56.25]
44        [15, 28.75]
45        (56.25, 70]
61      (28.75, 42.5]
66        [15, 28.75]
72      (28.75, 42.5]
101     (28.75, 42.5]
104       [15, 28.75]
110       [15, 28.75]
113     (28.75, 42.5]
118     (28.75, 42.5]
127     (42.5, 56.25]
132     (28.75, 42.5]
135       (56.25, 70]
155     (42.5, 56.25]
165     (42.5, 56.25]
189       [15, 28.75]
193     (42.5, 56.25]
194     (28.75, 42.5]
224     (42.5, 56.25]
246       (56.25, 70]
256     (42.5, 56.25]
273     (42.5, 56.25]
290       (56.25, 70]
302       (56.25, 70]
327     (42.5, 56.25]
330     (42.5, 56.25]
336       (56.25, 70]
361     (28.75, 42.5]
384     (42.5, 56.25]
410       (56.25, 70]
426       (56.25, 70]
482     (42.5, 56.25]
496       (56.25, 70]
513     (42.5, 56.25]
607       (56.25, 70]
642     (42.5, 56.25]
985       (56.25, 70]
1194      (56.25, 70]
1648      (56.25, 70]
Name: 연령, dtype: category
Categories (4, object): [[15, 28.75] < (28.75, 42.5] < (42.5, 56.25] < (56.25, 70]]

# 문자열

In [283]:
text = 'a.b,     guildo'

In [285]:
text.split('.')

['a', 'b,     guildo']

In [288]:
[문자.strip() for 문자 in text.split('.')]

['a', 'b,     guildo']

In [289]:
러시아인형 = '(((<<<{{{**인형****>>>>}}})))'

In [290]:
러시아인형.strip('()<>{}*')

'인형'

In [293]:
사람들 = '이김박'

In [294]:
':'.join(사람들)

'이:김:박'

In [295]:
로또 = [1,2,3,4,5,6]

In [311]:
로또문자 = '-'.join(map(str, 로또))
로또문자

'1-2-3-4-5-6'

In [312]:
로또[0::2]

[1, 3, 5]

In [316]:
"".join(map(str, 로또[-1::-1]))

'654321'

In [317]:
프로필 = ['이성주', 'seongjoo@codebasic.io']

In [318]:
print('이름: ' + 프로필[0] + ', 이메일: ' + 프로필[1])

이름: 이성주, 이메일: seongjoo@codebasic.io

In [326]:
출력양식 = '이름 : {0}, 이메일: {1}'
출력양식

'이름 : {0}, 이메일: {1}'

In [327]:
print(출력양식.format(*프로필))

이름 : 이성주, 이메일: seongjoo@codebasic.io

In [328]:
신체지수 = {'키': 175, '몸무게': 88}

In [335]:
print('키: {키}cm, 몸무게: {몸무게}kg'.format(**신체지수))

키: 175cm, 몸무게: 88kg

In [339]:
'{0} {0:.1f}'.format(3)

'3 3.0'

In [345]:
잔고 = 1234567890
'{0:,}'.format(잔고)

'1,234,567,890'

In [348]:
'{0:02d}월 {1:02d}월'.format(1, 12)

'01월 12월'

In [349]:
식당[:3]

,dine_type,corner,menu,is_sold_out,use_count,pred_count,additional,good,ok,bad,diff_use_pred,year,month,day,wday
date,,,,,,,,,,,,,,,
2013-08-06,dinner,grill & fry,훈제연어벤또(200개),F,213,0,0,0,0,0,-213,2013,8,6,1
2013-08-06,dinner,rice & soup 1,뚝배기 우거지 갈비탕,F,261,0,0,0,0,0,-261,2013,8,6,1
2013-08-06,lunch,noodle bar,판모밀정식,F,267,0,0,0,0,0,-267,2013,8,6,1

In [352]:
식당.rename(index=lambda 날짜: '{0}-{1:02d}'.format(날짜.year, 날짜.month)).sort_index()[:5]

,dine_type,corner,menu,is_sold_out,use_count,pred_count,additional,good,ok,bad,diff_use_pred,year,month,day,wday
date,,,,,,,,,,,,,,,
2013-08,dinner,grill & fry,훈제연어벤또(200개),F,213,0,0,0,0,0,-213,2013,8,6,1
2013-08,dinner,rice & soup 1,뚝배기 우거지 갈비탕,F,261,0,0,0,0,0,-261,2013,8,6,1
2013-08,lunch,noodle bar,판모밀정식,F,267,0,0,0,0,0,-267,2013,8,6,1
2013-08,breakfast,rice & soup 1,설렁탕정식,F,1,0,0,0,0,0,-1,2013,8,6,1
2013-08,lunch,rice & soup 1,A. 부대찌개정식,F,376,0,0,0,0,0,-376,2013,8,6,1

In [359]:
고객의견 = """여차저차해서여. 연락주세요 010-1234-5678. 감사합니다.
혹시, 통화가 안되시면
010-2323-8282 로 해주세요
"""

전화번호만 추출하고 싶다면

In [360]:
import re

In [361]:
전화번호패턴 = re.compile('\d{3}-\d{4}-\d{4}')
전화번호패턴.findall(고객의견)

['010-1234-5678', '010-2323-8282']

### 연습

yyyy년 mm월 dd일 형식의 날짜 추출

In [365]:
앨런튜링="""앨런 매티슨 튜링(영어: Alan Mathison Turing, OBE, FRS, 1912년 6월 23일 ~ 1954년 6월 7일)은 영국의 수학자, 암호학자, 논리학자이자 컴퓨터 과학의 선구적 인물이다. 알고리즘과 계산 개념을 튜링 기계라는 추상 모델을 통해 형식화함으로써 컴퓨터 과학의 발전에 지대한 공헌을 했다.[2][3][4] 튜링 테스트의 고안으로도 유명하다. ACM에서 컴퓨터 과학에 중요한 업적을 남긴 사람들에게 매년 시상하는 튜링상은 그의 이름을 따 제정한 것이다. 이론 컴퓨터 과학과 인공지능 분야에 지대한 공헌을 했기 때문에 "컴퓨터 과학의 아버지"라고 불린다.

1945년에 그가 고안한 튜링 머신은 초보적 형태의 컴퓨터로, 복잡한 계산과 논리 문제를 처리할 수 있었다. 하지만 튜링은 1952년에 당시에는 범죄로 취급되던 동성애 혐의로 영국 경찰에 체포돼 유죄 판결을 받았다.[5] 감옥에 가는 대신 화학적 거세를 받아야 했던 그는, 2년 뒤 청산가리를 넣은 사과를 먹고 자살했다.[5]

사후 59년만인 2013년 12월 24일에 엘리자베스 2세 여왕이 크리스 그레일링 법무부 장관의 건의를 받아들여 튜링의 동성애 죄를 사면하였다. 이어서 무죄 판결을 받고 복권되었다.[5]"""

In [375]:
날짜패턴 = re.compile('\d{4}년 \d{1,2}월 \d{1,2}일')
날짜패턴.findall(앨런튜링)

['1912년 6월 23일', '1954년 6월 7일', '2013년 12월 24일']

## PANDAS 벡터 단위 문자열 처리

시리즈 단위로 처리한다는 얘기

In [380]:
날씨.reset_index().weather.str.contains('비')[:3]

0    False
1     True
2    False
Name: weather, dtype: bool

In [382]:
날씨.reset_index().weather.str.contains('눈|비')[:3]

0    False
1     True
2    False
Name: weather, dtype: bool

In [392]:
식당.dine_type.str.upper().str[:3][:3]

date
2013-08-06    DIN
2013-08-06    DIN
2013-08-06    LUN
Name: dine_type, dtype: object

In [401]:
날씨.weather.str.split('/').str[:1][:3]

date
2013-08-01    [구름많음]
2013-08-02      [흐림]
2013-08-03      [흐림]
Name: weather, dtype: object

# 농무부 자료

In [403]:
import json

In [406]:
db = json.load(open('data/pydata-book/foods-2011-10-03.json'))

In [412]:
info = DataFrame(db, columns = ['description', 'group', 'id', 'manufacturer'])

In [413]:
info[:3]

       description                   group    id manufacturer
0  Cheese, caraway  Dairy and Egg Products  1008
1  Cheese, cheddar  Dairy and Egg Products  1009
2     Cheese, edam  Dairy and Egg Products  1018

In [409]:
nutrients = []
for rec in db:
    fnuts = DataFrame(rec['nutrients'])
    fnuts['id'] = rec['id']
    nutrients.append(fnuts)
    
nutrients = pd.concat(nutrients, ignore_index=True)

In [410]:
nutrients[:3]

                   description        group units  value    id
0                      Protein  Composition     g  25.18  1008
1            Total lipid (fat)  Composition     g  29.20  1008
2  Carbohydrate, by difference  Composition     g   3.06  1008

In [418]:
info = info.rename(columns={'description': '식품명', 'group': '식품군'})
info[:3]

               식품명                     식품군    id manufacturer
0  Cheese, caraway  Dairy and Egg Products  1008
1  Cheese, cheddar  Dairy and Egg Products  1009
2     Cheese, edam  Dairy and Egg Products  1018

In [419]:
nutrients = nutrients.rename(columns={'description': '영양소', 'group' : '영양소군'})

In [420]:
nutrients[:3]

                           영양소         영양소군 units  value    id
0                      Protein  Composition     g  25.18  1008
1            Total lipid (fat)  Composition     g  29.20  1008
2  Carbohydrate, by difference  Composition     g   3.06  1008

In [421]:
ndata = pd.merge(info, nutrients, on='id', how = 'outer')

In [425]:
ndata[['식품명', '영양소', 'value', 'units']][:3]

               식품명                          영양소  value units
0  Cheese, caraway                      Protein  25.18     g
1  Cheese, caraway            Total lipid (fat)  29.20     g
2  Cheese, caraway  Carbohydrate, by difference   3.06     g

영양소별 식품별 함유량

In [432]:
영양소별식품별 = ndata.groupby(['영양소', '식품명'])

In [436]:
영양소별식품별['value'].mean().unstack()[:5]

식품명,AMARANTH FLAKES,"APPLEBEE'S, 9 oz house sirloin steak","APPLEBEE'S, Double Crunch Shrimp","APPLEBEE'S, French fries","APPLEBEE'S, KRAFT, Macaroni & Cheese, from kid's menu","APPLEBEE'S, chicken fingers, from kids' menu","APPLEBEE'S, mozzarella sticks","ARCHWAY Home Style Cookies, Apple Filled Oatmeal","ARCHWAY Home Style Cookies, Apricot Filled","ARCHWAY Home Style Cookies, Cherry Filled",...,"Yellow pond lily, Wocas, dried seeds (Pacific Northwest Indians)","Yellow pond lily, Wocas, tuber, cooked (Pacific Northwest Indians)","Yogurt parfait, lowfat, with fruit and granola","Yogurt, chocolate, nonfat milk","Yogurt, fruit variety, nonfat","Yogurt, fruit variety, nonfat, fortified with vitamin D","Yogurt, fruit, lowfat, with low calorie sweetener, fortified with vitamin D","Yogurt, plain, skim milk, 13 grams protein per 8 ounce","Yogurt, vanilla or lemon flavor, nonfat milk, sweetened with low-calorie sweetener","Yogurt, vanilla, low fat, 11 grams protein per 8 ounce"
영양소,,,,,,,,,,,,,,,,,,,,,
Adjusted Protein,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Alanine,NaN,1.522,0.716,NaN,0.224,1.003,0.463,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,0.212,0.212,0.208,0.245,NaN,0.211
"Alcohol, ethyl",0.00,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,0.00,0.00,0.0,0.00,0.000,0.000,0.000,0.000,0.0,0.000
Arginine,NaN,1.790,1.029,NaN,0.245,1.167,0.535,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,0.151,0.151,0.146,0.172,NaN,0.148
Ash,3.27,2.350,2.450,2.55,1.670,2.370,3.330,1.55,1.46,1.5,...,1.65,0.49,0.8,1.37,1.000,1.000,1.030,1.180,1.0,1.020

In [439]:
import pandas as pd

In [440]:
import baseball

In [441]:
파일목록 = [
    'data/NC Dinos {}.xlsx'.format(y) for y in range(2013, 2015)
]
NC시즌 = baseball.from_files(파일목록)

In [445]:
식당.groupby('corner')

In [446]:
식당.groupby('corner')['use_count']

In [447]:
식당.groupby('corner').size()

corner
after school      929
burger&pizza      913
grill & fry       925
noodle bar        923
rice & soup 1    1422
rice & soup 2     332
take out         1381
dtype: int64

In [449]:
식당.groupby('corner')['use_count'].mean()

corner
after school     140.921421
burger&pizza     144.285871
grill & fry      225.996757
noodle bar       179.244854
rice & soup 1    221.974684
rice & soup 2    241.897590
take out         190.789283
Name: use_count, dtype: float64

In [450]:
식당.groupby('corner')['use_count']

In [451]:
식당.groupby('corner')[['use_count']]

In [452]:
식당.groupby('corner')[['use_count']].mean()

                use_count
corner
after school   140.921421
burger&pizza   144.285871
grill & fry    225.996757
noodle bar     179.244854
rice & soup 1  221.974684
rice & soup 2  241.897590
take out       190.789283

In [456]:
식당.groupby('corner').mean()

,use_count,pred_count,additional,good,ok,bad,diff_use_pred,year,month,day,wday
corner,,,,,,,,,,,
after school,140.921421,54.617869,7.728741,5.551130,2.776103,0.528525,-78.574812,2014.093649,6.519914,16.118407,1.939720
burger&pizza,144.285871,64.123768,9.052574,7.107338,3.124863,0.745893,-71.109529,2014.105148,6.465498,16.032859,1.940854
grill & fry,225.996757,89.886486,11.281081,9.498378,5.041081,1.370811,-124.829189,2014.095135,6.505946,16.105946,1.931892
noodle bar,179.244854,69.404117,9.653304,9.533044,4.211268,1.247021,-100.187432,2014.096425,6.479957,16.035753,1.926327
rice & soup 1,221.974684,74.936709,10.759494,8.064698,3.441632,0.879044,-136.278481,2014.089311,6.530239,16.028129,1.940928
rice & soup 2,241.897590,149.231928,15.722892,18.322289,8.210843,1.614458,-76.942771,2014.397590,6.042169,16.162651,1.930723
take out,190.789283,58.929761,2.302679,0.199131,0.068791,0.020999,-129.556843,2014.127444,6.444605,16.013758,1.946416

## 연습

각 지역별 평균 기온 산출

1. 가독성을 높이기 위해 열제목을 적절한 한글로 설정
1. 지역별 연도별 평균 기온 산출

In [485]:
날씨2 = pd.read_excel('data/weather.xlsx')
날씨2 = 날씨2[['location', 'date', 'avgTemp']]
날씨2 = 날씨2.rename(columns={'location': '지역', 'date': '날짜', 'avgTemp': '평균온도'})

In [486]:
def 연도추출(날짜):
    return 날짜.year

In [488]:
날씨2['연도'] = 날씨2['날짜'].apply(연도추출)
날씨2

         지역         날짜  평균온도    연도
0     seoul 2013-08-01  28.0  2013
1     seoul 2013-08-02  27.4  2013
2     seoul 2013-08-03  28.9  2013
3     seoul 2013-08-04  28.3  2013
4     seoul 2013-08-05  27.7  2013
5     seoul 2013-08-06  26.4  2013
6     seoul 2013-08-07  28.7  2013
7     seoul 2013-08-08  29.3  2013
8     seoul 2013-08-09  29.2  2013
9     seoul 2013-08-10  28.0  2013
10    seoul 2013-08-11  28.7  2013
11    seoul 2013-08-12  29.3  2013
12    seoul 2013-08-13  29.0  2013
13    seoul 2013-08-14  28.6  2013
14    seoul 2013-08-15  28.7  2013
15    seoul 2013-08-16  28.7  2013
16    seoul 2013-08-17  28.7  2013
17    seoul 2013-08-18  28.3  2013
18    seoul 2013-08-19  28.2  2013
19    seoul 2013-08-20  27.4  2013
20    seoul 2013-08-21  28.8  2013
21    seoul 2013-08-22  29.3  2013
22    seoul 2013-08-23  25.7  2013
23    seoul 2013-08-24  26.6  2013
24    seoul 2013-08-25  27.1  2013
25    seoul 2013-08-26  27.0  2013
26    seoul 2013-08-27  25.6  2013
27    seoul 2013-08-28  26.4  2013
28    seoul 2013-08-29  25.5  2013
29    seoul 2013-08-30  25.1  2013
...     ...        ...   ...   ...
1430  suwon 2015-07-02  23.4  2015
1431  suwon 2015-07-03  22.7  2015
1432  suwon 2015-07-04  23.1  2015
1433  suwon 2015-07-05  23.3  2015
1434  suwon 2015-07-06  24.2  2015
1435  suwon 2015-07-07  24.1  2015
1436  suwon 2015-07-08  22.6  2015
1437  suwon 2015-07-09  25.6  2015
1438  suwon 2015-07-10  28.0  2015
1439  suwon 2015-07-11  29.3  2015
1440  suwon 2015-07-12  25.0  2015
1441  suwon 2015-07-13  23.1  2015
1442  suwon 2015-07-14  25.2  2015
1443  suwon 2015-07-15  27.5  2015
1444  suwon 2015-07-16  25.0  2015
1445  suwon 2015-07-17  24.0  2015
1446  suwon 2015-07-18  23.8  2015
1447  suwon 2015-07-19  24.8  2015
1448  suwon 2015-07-20  27.7  2015
1449  suwon 2015-07-21  26.7  2015
1450  suwon 2015-07-22  27.0  2015
1451  suwon 2015-07-23  26.2  2015
1452  suwon 2015-07-24  24.5  2015
1453  suwon 2015-07-25  25.4  2015
1454  suwon 2015-07-26  27.5  2015
1455  suwon 2015-07-27  25.9  2015
1456  suwon 2015-07-28  27.7  2015
1457  suwon 2015-07-29  26.3  2015
1458  suwon 2015-07-30  28.5  2015
1459  suwon 2015-07-31  27.6  2015

[1460 rows x 4 columns]

In [490]:
지역별연도별 = 날씨2.groupby(['지역', '연도'])

In [495]:
지역별연도별.mean()

                 평균온도
지역    연도
seoul 2013  14.241176
      2014  13.396712
      2015  12.680189
suwon 2013  14.192810
      2014  13.145479
      2015  12.464151

In [498]:
지역별연도별

In [502]:
list(지역별연도별)[0]

(('seoul', 2013),         지역         날짜  평균온도    연도
 0    seoul 2013-08-01  28.0  2013
 1    seoul 2013-08-02  27.4  2013
 2    seoul 2013-08-03  28.9  2013
 3    seoul 2013-08-04  28.3  2013
 4    seoul 2013-08-05  27.7  2013
 5    seoul 2013-08-06  26.4  2013
 6    seoul 2013-08-07  28.7  2013
 7    seoul 2013-08-08  29.3  2013
 8    seoul 2013-08-09  29.2  2013
 9    seoul 2013-08-10  28.0  2013
 10   seoul 2013-08-11  28.7  2013
 11   seoul 2013-08-12  29.3  2013
 12   seoul 2013-08-13  29.0  2013
 13   seoul 2013-08-14  28.6  2013
 14   seoul 2013-08-15  28.7  2013
 15   seoul 2013-08-16  28.7  2013
 16   seoul 2013-08-17  28.7  2013
 17   seoul 2013-08-18  28.3  2013
 18   seoul 2013-08-19  28.2  2013
 19   seoul 2013-08-20  27.4  2013
 20   seoul 2013-08-21  28.8  2013
 21   seoul 2013-08-22  29.3  2013
 22   seoul 2013-08-23  25.7  2013
 23   seoul 2013-08-24  26.6  2013
 24   seoul 2013-08-25  27.1  2013
 25   seoul 2013-08-26  27.0  2013
 26   seoul 2013-08-27  25.6  2013
 27   seoul 2013-08-28  26.4  2013
 28   seoul 2013-08-29  25.5  2013
 29   seoul 2013-08-30  25.1  2013
 ..     ...        ...   ...   ...
 123  seoul 2013-12-02   3.9  2013
 124  seoul 2013-12-03   6.7  2013
 125  seoul 2013-12-04   5.5  2013
 126  seoul 2013-12-05   5.5  2013
 127  seoul 2013-12-06   3.0  2013
 128  seoul 2013-12-07   6.2  2013
 129  seoul 2013-12-08   4.2  2013
 130  seoul 2013-12-09   3.8  2013
 131  seoul 2013-12-10   0.3  2013
 132  seoul 2013-12-11  -1.7  2013
 133  seoul 2013-12-12  -3.2  2013
 134  seoul 2013-12-13  -6.8  2013
 135  seoul 2013-12-14  -4.9  2013
 136  seoul 2013-12-15  -4.4  2013
 137  seoul 2013-12-16  -3.6  2013
 138  seoul 2013-12-17  -0.3  2013
 139  seoul 2013-12-18   2.2  2013
 140  seoul 2013-12-19  -3.5  2013
 141  seoul 2013-12-20  -4.0  2013
 142  seoul 2013-12-21  -3.1  2013
 143  seoul 2013-12-22  -2.1  2013
 144  seoul 2013-12-23  -1.1  2013
 145  seoul 2013-12-24  -1.6  2013
 146  seoul 2013-12-25  -0.5  2013
 147  seoul 2013-12-26  -0.5  2013
 148  seoul 2013-12-27  -6.8  2013
 149  seoul 2013-12-28  -6.5  2013
 150  seoul 2013-12-29  -2.9  2013
 151  seoul 2013-12-30   2.2  2013
 152  seoul 2013-12-31   3.8  2013

 [153 rows x 4 columns])

In [504]:
for 그룹명, 그룹 in 지역별연도별:
    print('{}, 크기:{}'.format(그룹명, len(그룹)))

('seoul', 2013), 크기:153
('seoul', 2014), 크기:365
('seoul', 2015), 크기:212
('suwon', 2013), 크기:153
('suwon', 2014), 크기:365
('suwon', 2015), 크기:212

# 함수로 묶기

* 함수는 색인에 대해 적용됩니다.

In [506]:
식당3 = 식당.reset_index().set_index('date')

In [507]:
식당3[:3]

,dine_type,corner,menu,is_sold_out,use_count,pred_count,additional,good,ok,bad,diff_use_pred,year,month,day,wday
date,,,,,,,,,,,,,,,
2013-08-06,dinner,grill & fry,훈제연어벤또(200개),F,213,0,0,0,0,0,-213,2013,8,6,1
2013-08-06,dinner,rice & soup 1,뚝배기 우거지 갈비탕,F,261,0,0,0,0,0,-261,2013,8,6,1
2013-08-06,lunch,noodle bar,판모밀정식,F,267,0,0,0,0,0,-267,2013,8,6,1

In [509]:
월별 = 식당3.groupby(lambda 날짜: '{}-{:02d}'.format(날짜.year, 날짜.month))

In [510]:
월별['use_count'].mean()[:3]

2013-08    253.843972
2013-09    249.778723
2013-10    237.687919
Name: use_count, dtype: float64

## 연습

식당 주문 기록의 월별 코너별 주문수량 평균 집계

In [521]:
식당4 = 식당.reset_index()

In [522]:
식당4[:3]

,date,dine_type,corner,menu,is_sold_out,use_count,pred_count,additional,good,ok,bad,diff_use_pred,year,month,day,wday
0,2013-08-06,dinner,grill & fry,훈제연어벤또(200개),F,213,0,0,0,0,0,-213,2013,8,6,1
1,2013-08-06,dinner,rice & soup 1,뚝배기 우거지 갈비탕,F,261,0,0,0,0,0,-261,2013,8,6,1
2,2013-08-06,lunch,noodle bar,판모밀정식,F,267,0,0,0,0,0,-267,2013,8,6,1

In [525]:
식당4['월'] = 식당4['date'].apply(lambda date: '{}-{:02d}'.format(date.year, date.month))

In [526]:
식당4[:3]

,date,dine_type,corner,menu,is_sold_out,use_count,pred_count,additional,good,ok,bad,diff_use_pred,year,month,day,wday,월
0,2013-08-06,dinner,grill & fry,훈제연어벤또(200개),F,213,0,0,0,0,0,-213,2013,8,6,1,2013-08
1,2013-08-06,dinner,rice & soup 1,뚝배기 우거지 갈비탕,F,261,0,0,0,0,0,-261,2013,8,6,1,2013-08
2,2013-08-06,lunch,noodle bar,판모밀정식,F,267,0,0,0,0,0,-267,2013,8,6,1,2013-08

In [530]:
식당4.groupby(['월', 'corner'])[['use_count']].sum()

                       use_count
월       corner
2013-08 after school        3241
        burger&pizza        3202
        grill & fry         6890
        noodle bar          5099
        rice & soup 1      13901
        take out            3459
2013-09 after school        5477
        burger&pizza        4701
        grill & fry        10140
        noodle bar          6957
        rice & soup 1      18463
        take out           12960
2013-10 after school        6602
        burger&pizza        5840
        grill & fry        11196
        noodle bar          8989
        rice & soup 1      20761
        take out           17443
2013-11 after school        7328
        burger&pizza        6151
        grill & fry        10484
        noodle bar          8791
        rice & soup 1      20325
        take out           10440
2013-12 after school        6697
        burger&pizza        5568
        grill & fry         8381
        noodle bar          7832
        rice & soup 1      18647
        take out           14718
...                          ...
2015-03 rice & soup 2       5295
        take out            9618
2015-04 after school        4748
        burger&pizza        5533
        grill & fry         8865
        noodle bar          6986
        rice & soup 1      10736
        rice & soup 2       4709
        take out            9500
2015-05 after school        4041
        burger&pizza        4076
        grill & fry         7176
        noodle bar          5597
        rice & soup 1       9310
        rice & soup 2       3754
        take out            7761
2015-06 after school        5434
        burger&pizza        5785
        grill & fry         9040
        noodle bar          7375
        rice & soup 1      11454
        rice & soup 2       5829
        take out           10655
2015-07 after school        4197
        burger&pizza        4997
        grill & fry         7595
        noodle bar          6434
        rice & soup 1      10078
        rice & soup 2       4351
        take out            8907

[162 rows x 1 columns]

# 분류별 집계

In [533]:
for 연도, 프레임 in zip(range(2013, 2015), NC시즌):
    프레임['시즌'] = 연도

In [536]:
NC시즌 = pd.concat(NC시즌)

In [538]:
NC시즌 = NC시즌.set_index('시즌', append=True)

In [539]:
NC시즌 = NC시즌.swaplevel(0,1)

In [541]:
NC시즌[:10]

           안타  홈런   타석
시즌   선수명
2013 모창민  109  12  436
     이호준  123  20  508
     김종호  129   0  546
     나성범   98  14  458
     조영훈  107   6  426
     이현곤   38   0  161
     이상호   31   0  138
     강진성    1   0    3
     조평호   21   2   86
     박민우   11   0   48

In [542]:
시즌별 = NC시즌.groupby(level='시즌')

In [543]:
시즌별

In [546]:
시즌별.describe()

                    안타         홈런          타석
시즌
2013 count   20.000000  20.000000   20.000000
     mean    40.700000   3.150000  177.450000
     std     46.741281   5.659412  197.772723
     min      0.000000   0.000000    1.000000
     25%      1.000000   0.000000    6.500000
     50%     22.500000   0.000000  103.500000
     75%     75.500000   3.250000  373.500000
     max    129.000000  20.000000  546.000000
2014 count   20.000000  20.000000   20.000000
     mean    51.950000   6.950000  203.850000
     std     59.242121  10.937502  222.860654
     min      0.000000   0.000000    1.000000
     25%      0.750000   0.000000    4.500000
     50%     17.000000   1.000000   80.000000
     75%    111.250000   6.250000  473.750000
     max    157.000000  37.000000  536.000000

In [547]:
def 최대최소차(시리즈):
    return 시리즈.max() - 시리즈.min()

In [548]:
시즌별.agg(최대최소차)

       안타  홈런   타석
시즌
2013  129  20  545
2014  157  37  535

열마다 다른함수

In [550]:
선수별 = NC시즌.groupby(level='선수명')

In [551]:
선수별.agg({'타석':'max', '안타': ['sum', 'mean']})

       안타          타석
      sum   mean  max
선수명
강구성     0    0.0    2
강민국     0    0.0    3
강진성     1    1.0    3
권희동    63   63.0  252
김동건     2    2.0   17
김성욱     5    2.5   26
김종찬     1    1.0    7
김종호   129  129.0  546
김준완     2    2.0    5
김태우     1    1.0    5
나성범   255  127.5  536
노진혁     3    3.0   16
마낙길     9    4.5   31
모창민   219  109.5  468
박명환*    0    0.0    1
박민우   135   67.5  491
박정준    41   41.0  195
손시헌    90   90.0  361
이상호    31   31.0  138
이승호     0    0.0    1
이종욱   126  126.0  495
이창섭     0    0.0    5
이현곤    38   38.0  161
이호준   238  119.0  508
조영훈   136   68.0  426
조평호    21   10.5   86
지석훈   126   63.0  356
차화준    24   24.0  121
최재원     0    0.0    2
테임즈   152  152.0  514
허준      5    5.0   36

In [552]:
def 집계(데이터, 방법):
    결과 = 방법(데이터)
    return 결과

In [553]:
데이터 = [1,2,3,4,5]

In [554]:
집계(데이터, sum)

15

In [557]:
집계(데이터, max)

5

타율 상위 10%

In [558]:
def 상위타율(그룹, 백분위수=0.9):
    타수합계 = 그룹.안타 + 그룹.홈런
    백분위값 = 타수합계.quantile(백분위수)
    상위그룹 = 그룹[타수합계 > 백분위값]
    상위그룹 = 상위그룹.sort_values(
        by=['안타', '홈런'], ascending=False)
    return 상위그룹

In [561]:
시즌별.apply(상위타율).reset_index(0, drop=True)

           안타  홈런   타석
시즌   선수명
2013 김종호  129   0  546
     이호준  123  20  508
2014 나성범  157  30  536
     테임즈  152  37  514